In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.dates as mdates

In [2]:
application_details=pd.read_csv('applications data.csv')

In [3]:
application_details.head()

,record,date,ssn,firstname,lastname,address,zip5,dob,homephone,fraud_label
0,1,20160101,379070012,XRRAMMTR,SMJETJMJ,6861 EUTST PL,2765,19070626,1797504115,0
1,2,20160101,387482503,MAMSTUJR,RTTEMRRR,7280 URASA PL,57169,19340615,4164239415,1
2,3,20160101,200332444,SZMMUJEZS,EUSEZRAE,5581 RSREX LN,56721,19070626,216537580,0
3,4,20160101,747451317,SJJZSXRSZ,ETJXTXXS,1387 UJZXJ RD,35286,19440430,132144161,0
4,5,20160101,24065868,SSSXUEJMS,SSUUJXUZ,279 EAASA WY,3173,19980315,6101082272,0

In [5]:
application_details.dtypes

record          int64
date            int64
ssn             int64
firstname      object
lastname       object
address        object
zip5            int64
dob             int64
homephone       int64
fraud_label     int64
dtype: object

In [4]:
application_details.shape

(1000000, 10)

In [6]:
application_details.isnull().sum()

record         0
date           0
ssn            0
firstname      0
lastname       0
address        0
zip5           0
dob            0
homephone      0
fraud_label    0
dtype: int64

In [7]:
application_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 10 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   record       1000000 non-null  int64
 1   date         1000000 non-null  int64
 2   ssn          1000000 non-null  int64
 3   firstname    1000000 non-null  object
 4   lastname     1000000 non-null  object
 5   address      1000000 non-null  object
 6   zip5         1000000 non-null  int64
 7   dob          1000000 non-null  int64
 8   homephone    1000000 non-null  int64
 9   fraud_label  1000000 non-null  int64
dtypes: int64(7), object(3)
memory usage: 76.3+ MB

In [8]:
application_details['date'] = pd.to_datetime(application_details['date'], format='%Y%m%d')
application_details['dob'] = pd.to_datetime(application_details['dob'], format='%Y%m%d')

In [9]:
categ_cols=['ssn','firstname','lastname','address','zip5','homephone','fraud_label']
for col in categ_cols:
    application_details[col]=application_details[col].astype("category")

In [14]:
application_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 10 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   record       1000000 non-null  int64
 1   date         1000000 non-null  datetime64[ns]
 2   ssn          1000000 non-null  category
 3   firstname    1000000 non-null  category
 4   lastname     1000000 non-null  category
 5   address      1000000 non-null  category
 6   zip5         1000000 non-null  category
 7   dob          1000000 non-null  datetime64[ns]
 8   homephone    1000000 non-null  category
 9   fraud_label  1000000 non-null  category
dtypes: category(7), datetime64[ns](2), int64(1)
memory usage: 130.5 MB

In [10]:
application_details[col].isnull().sum()

0

In [11]:
categ_cols=['record','ssn','firstname','lastname','address','zip5','homephone','fraud_label']
num_records=[]
percent_populated=[]
unique_values=[]
most_common=[]
for col in categ_cols:
    num_records.append(application_details[col].shape[0])
    percent_populated.append((1-application_details[col].isnull().sum()/application_details.shape[0])*100)
    unique_values.append(application_details[col].nunique())
    most_common.append(application_details[col].value_counts().idxmax())

In [12]:
print(most_common)
print(unique_values)
print(num_records)
print(percent_populated)

[1, 999999999, 'EAMSTRMT', 'ERJSAXA', '123 MAIN ST', 68138, 9999999999, 0]
[1000000, 835819, 78136, 177001, 828774, 26370, 28244, 2]
[1000000, 1000000, 1000000, 1000000, 1000000, 1000000, 1000000, 1000000]
[100.0, 100.0, 100.0, 100.0, 100.0, 100.0, 100.0, 100.0]

In [13]:
stats_data={'Column Name':categ_cols,'# of Records':num_records,
           '% Populated':percent_populated,'Unique Values':unique_values,'Most Common Field Value':most_common}
stats_table=pd.DataFrame(data=stats_data)

In [14]:
stats_table

,Column Name,# of Records,% Populated,Unique Values,Most Common Field Value
0,record,1000000,100.0,1000000,1
1,ssn,1000000,100.0,835819,999999999
2,firstname,1000000,100.0,78136,EAMSTRMT
3,lastname,1000000,100.0,177001,ERJSAXA
4,address,1000000,100.0,828774,123 MAIN ST
5,zip5,1000000,100.0,26370,68138
6,homephone,1000000,100.0,28244,9999999999
7,fraud_label,1000000,100.0,2,0

In [15]:
countrec_day=application_details.groupby('date')['record'].count().reset_index().rename(columns={'record':'count'})
countrec_day

          date  count
0   2016-01-01   2840
1   2016-01-02   2719
2   2016-01-03   2764
3   2016-01-04   2757
4   2016-01-05   2732
..         ...    ...
360 2016-12-27   2718
361 2016-12-28   2832
362 2016-12-29   2767
363 2016-12-30   2684
364 2016-12-31   2814

[365 rows x 2 columns]

In [26]:
countrec_day.max()

date     2016-12-31 00:00:00
count                   2877
dtype: object

In [27]:
countrec_day.min()

date     2016-01-01 00:00:00
count                   2607
dtype: object

In [23]:
countrec_day.describe()

                                date        count
count                            365   365.000000
mean   2016-07-01 20:07:13.972602624  2739.726027
min              2016-01-01 00:00:00  2607.000000
25%              2016-04-02 00:00:00  2705.000000
50%              2016-07-02 00:00:00  2739.000000
75%              2016-10-01 00:00:00  2774.000000
max              2016-12-31 00:00:00  2877.000000
std                              NaN    48.006484

In [31]:
ssn_count=application_details['ssn'].value_counts().sort_values(ascending=False).reset_index()\
                        .rename(columns={'index':'SSN','ssn':'Count'})[:20]

In [32]:
print(ssn_count)

        Count  count
0   999999999  16935
1   938972725    114
2   810776805     81
3   829352390     74
4   473311863     44
5   165764866     34
6   295308935     30
7   189622157     30
8   588726212     29
9   163830210     29
10  687424410     28
11  826488428     25
12  407447121     24
13  901493436     24
14   77441357     24
15  457346566     24
16  406203526     23
17  256440495     23
18  258312431     23
19  325064391     23